## Exercise  11.1 
Suppose we start with an empty database. We then give the command:

    assert(q(a,b)),  assertz(q(1,2)),  asserta(q(foo,blug)).
What does the database now contain?
```
q(foo,blug).
q(a,b).
q(1,2).
```
We then give the command:

    retract(q(1,2)),  assertz(  (p(X)  :-    h(X))  ).
What does the database now contain?
```
q(foo,blug).
q(a,b).
p(X) :- h(x).
```

We then give the command:

   retractall(q(_,_)).
What does the database now contain?
```
p(X) :- h(X).
```
## Exercise  11.2 
Suppose we have the following database:
```
q(blob,blug).
q(blob,blag).
q(blob,blig).
q(blaf,blag).
q(dang,dong).
q(dang,blug).
q(flab,blob).
```
What is Prologâ€™s response to the queries:
```
?- findall(X,q(blob,X),List).
    List=[blug, blag, blig];
?- findall(X,q(X,blug),List).
    List=[blob, dang];
?- findall(X,q(X,Y),List).
    List=[blob, blob, blob, blaf, dang, dang, flab];
?- bagof(X,q(X,Y),List).
    Y=blug
    List=[blob, dang];
    Y=blag
    List=[blob, blaf];
    Y=blig
    List=[blob];
    Y=dong
    List=[dang];
    Y=blob
    List=[flab];
?- setof(X,Y^q(X,Y),List).
    List=[blaf, blob, dang, flab]
```

## Exercise  11.3 
Write a predicate sigma/2 that takes an integer n > 0 and calculates the sum of all integers from 1 to n . For example:
```
   ?-  sigma(3,X).
   X  =  6
   yes
   ?-  sigma(5,X).
   X  =  15
   yes
```
Write the predicate so that results are stored in the database (there should never be more than one entry in the database for each value) and are reused whenever possible. For example, suppose we make the following query:
```
   ?-  sigma(2,X).
   X  =  3
   yes
   ?-  listing.
   sigmares(2,3).
```
Then, if we go on to ask

    ?-  sigma(3,X).
Prolog should not calculate everything new, but should get the result for sigma(2,3) from the database and only add 3 to that. It should then answer:
```
   X  =  6
   yes
   ?-  listing.
   sigmares(2,3).
   sigmares(3,6).
```


```
:- dynamic sigmares/2.

sigma(N, X) :-
    sigmares(N, X),
    !.

sigma(N, X) :- 
    sigmaAcc(N, 0, X),
    assert(sigmares(N, X)).

sigmaAcc(1, A, X) :-
    X is A + 1,
    !.
sigmaAcc(N, A, X) :- 
    N > 1,
    T is A + N,
    Next is N - 1,
    !,
    sigmaAcc(Next, T, X).
```
